      *> Program-ID:    .cob
      *> Author:        Tyler Oalman
      *> OS:            Arch Linux
      *> Compiler:      GNU Cobol

       identification division.
       program-id.    $NAME.
