      *> Display "Hello" on your screen
      *> Program-ID: TSimple.cob
      *> Author:     Tyler Oalman
      *> OS:         Arch Linux
      *> Compiler:   OpenCOBOL

       identification division.
       program-id. TSimple.
       procedure division.
           display "Hello".
           stop run.

      *> Input:    No
      *> Output:
      *>    Hello
